DataProcessors/ФормированиеОтчетаУРВ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>ФормированиеОтчетаУРВ</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоОпоздавшие</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОтчетыПоДЦ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДЦ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДилерскиеЦентры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ГрафикРаботКалендарный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ГрафикРаботКалендарный</Name>
			<Comment>График работ календарный</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидДня</Name>
					<Comment>Вид дня</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидДня</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Банковский</Name>
					<Comment>Банковский</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Продолжительность</Name>
					<Comment>Продолжительность</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидИнтервала</Name>
					<Comment>Вид интервала</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыИнтервалов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Основной</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Произвольный комментарий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>График</Name>
					<Comment>График</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Comment>Дата</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НачалоРабочегоВремени</Name>
					<Comment>Начало рабочего времени</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КонецРабочегоВремени</Name>
					<Comment>Конец рабочего времени</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Смена</Name>
					<Comment>Смена</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Смены</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/РегистрацияВремениСотрудника.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>РегистрацияВремениСотрудника</Name>
			<Comment>Регистрация времени сотрудника</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КонецРаботы</Name>
					<Comment>Конец работы</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Продолжительность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АвтосалонПриход</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Компьютеры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПутькФайлуПриход</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПутькФайлуУход</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АвтосалонУход</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Компьютеры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Comment>Сотрудник</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОтметки</Name>
					<Comment>Вид отметки</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыОтметокВремени</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/РассылкаПочты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>РассылкаПочты</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудники</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипРассылки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыРассылок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИсточникРассылки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИсточникиРассылки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидДня.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидДня</Name>
			<Comment>Вид дня</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Рабочий</Name>
					<Comment>Рабочий</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Предпраздничный</Name>
					<Comment>Предпраздничный</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Праздник</Name>
					<Comment>Праздник</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выходной</Name>
					<Comment>Выходной</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Командировка</Name>
					<Comment>Сотрудник находится в командировке</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ИсточникиРассылки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ИсточникиРассылки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Жалоба</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УРВ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УРВОпоздавшие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПовторныеРемонты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СкладскиеОтчеты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СкладАвтомобилей</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПредстоящиеОплатыПокупателей</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неоплаченные</Name>
					<Comment>Неоплаченные</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Незакрытые</Name>
					<Comment>Незакрытые</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыРассылок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ТипыРассылок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>КлиенскаяСлужба</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Руководители</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сервис</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтчетПоУРВ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВсеОтчетыПоУРВ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РОС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РК</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолучателиСкладскихОтчетов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтарыеЗапасы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОптовыеПродажи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеоплаченныеЗН</Name>
					<Comment>Неоплаченные заказ-наряды</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВсеНеоплаченныеЗН</Name>
					<Comment>Все неоплаченные заказ-наряды</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НезакрытыеЗН</Name>
					<Comment>Незакрытые заказ-наряды</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВсеНезакрытыеЗН</Name>
					<Comment>Все незакрытые заказ-наряды</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/КодГруппыАдресаЭлектронногоПисьма.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>КодГруппыАдресаЭлектронногоПисьма</Name>
			<Comment>Перечисление кодов группы адреса электронного письма</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Кому</Name>
					<Comment>Кому</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Копии</Name>
					<Comment>Копия</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СкрытыеКопии</Name>
					<Comment>Скрытая копия</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/Важность.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>Важность</Name>
			<Comment>Важность</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Высокая</Name>
					<Comment>Высокая степень важности</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Средняя</Name>
					<Comment>Средняя степень важности</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Низкая</Name>
					<Comment>Низкая степень важности</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ФорматТекста.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ФорматТекста</Name>
			<Comment>Тип текста HTML или Простой текст</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>HTML</Name>
					<Comment>Формат текста HTML </Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПростойТекст</Name>
					<Comment>Текстовый формат </Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/ФормированиеОтчетаУРВ/Ext/ObjectModule.bsl
Процедура СформироватьОтчет(ТолькоОпоздавшие = Ложь) Экспорт
	ПустаяДата = Дата(1, 1, 1);
	Дата = НачалоДня(Дата);
	ОтчетыПоДЦ.Очистить();
	
	// Запрос для списка нарушителей
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Сотрудники.Ссылка КАК Сотрудник,
	                      |	Сотрудники.Должность,
	                      |	Сотрудники.Подразделение.ДилерскийЦентр КАК ДилерскийЦентр,
	                      |	ГрафикРаботКалендарный.НачалоРабочегоВремени КАК НачалоРаботыГрафик,
	                      |	ГрафикРаботКалендарный.КонецРабочегоВремени КАК КонецРаботыГрафик,
	                      |	ГрафикРаботКалендарный.Продолжительность,
	                      |	Сотрудники.Наименование КАК СотрудникФИО
	                      |ПОМЕСТИТЬ Графики
	                      |ИЗ
	                      |	РегистрСведений.ГрафикРаботКалендарный КАК ГрафикРаботКалендарный
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
	                      |		ПО ГрафикРаботКалендарный.График = Сотрудники.ГрафикРаботы
	                      |ГДЕ
	                      |	НЕ Сотрудники.ФлагУволен
	                      |			И НЕ Сотрудники.ПометкаУдаления
	                      |	И ГрафикРаботКалендарный.Дата = &Дата
	                      |	И ГрафикРаботКалендарный.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидДня.Рабочий)
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	РегистрацияВремениСотрудника.Сотрудник,
	                      |	МИНИМУМ(РегистрацияВремениСотрудника.Период) КАК НачалоРаботы,
	                      |	МАКСИМУМ(РегистрацияВремениСотрудника.КонецРаботы) КАК КонецРаботы,
	                      |	СУММА(РегистрацияВремениСотрудника.Продолжительность) КАК Продолжительность
	                      |ПОМЕСТИТЬ ДанныеУРВ
	                      |ИЗ
	                      |	РегистрСведений.РегистрацияВремениСотрудника КАК РегистрацияВремениСотрудника
	                      |ГДЕ
	                      |	РегистрацияВремениСотрудника.ВидОтметки = ЗНАЧЕНИЕ(Справочник.ВидыОтметокВремени.Работа)
	                      |	И РегистрацияВремениСотрудника.Период МЕЖДУ НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата, ДЕНЬ)
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	РегистрацияВремениСотрудника.Сотрудник
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	Графики.СотрудникФИО КАК СотрудникФИО,
	                      |	Графики.Должность,
	                      |	Графики.ДилерскийЦентр КАК ДилерскийЦентр,
	                      |	Графики.НачалоРаботыГрафик,
	                      |	ЕСТЬNULL(ДанныеУРВ.НачалоРаботы, ДАТАВРЕМЯ(1, 1, 1)) КАК НачалоРаботыФакт,
	                      |	Графики.КонецРаботыГрафик,
	                      |	ЕСТЬNULL(ДанныеУРВ.КонецРаботы, ДАТАВРЕМЯ(1, 1, 1)) КАК КонецРаботыФакт
	                      |ИЗ
	                      |	Графики КАК Графики
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеУРВ КАК ДанныеУРВ
	                      |		ПО Графики.Сотрудник = ДанныеУРВ.Сотрудник
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Графики.СотрудникФИО");
	Запрос.УстановитьПараметр("Дата", Дата);
			
	Результат = Запрос.Выполнить().Выгрузить();
	
	ТаблицаДЦ = Результат.Скопировать();
	ТаблицаДЦ.Свернуть("ДилерскийЦентр");
	Для Каждого СтрокаДЦ Из ТаблицаДЦ Цикл
		ТабДокумент = Новый ТабличныйДокумент();
		Макет = ПолучитьМакет("Отчёт");
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		ОбластьМакета.Параметры.Дата = Формат(Дата, "ДЛФ=ДД");
		ТабДокумент.Вывести(ОбластьМакета);
		ОбластьМакета = Макет.ПолучитьОбласть("СтрокаДЦ");
		ОбластьМакета.Параметры.ДЦ = Строка(СтрокаДЦ.ДилерскийЦентр);
		ТабДокумент.Вывести(ОбластьМакета);

		МассивСтрок = Результат.НайтиСтроки(Новый Структура("ДилерскийЦентр", СтрокаДЦ.ДилерскийЦентр));				
		сч = 0;
		Для Каждого СтрокаТаблицы Из МассивСтрок Цикл
			ЧислоСекунд = СтрокаТаблицы.НачалоРаботыФакт - Дата;
			НачалоРаботы = ПустаяДата + ЧислоСекунд;
			ЧислоСекунд = СтрокаТаблицы.КонецРаботыФакт - Дата;
			КонецРаботы = ПустаяДата + ЧислоСекунд;
			Прогул = Ложь;
			
			ОбластьМакета = Макет.ПолучитьОбласть("Строка");
			ВидНарушения = "";
			Если СтрокаТаблицы.НачалоРаботыФакт = ПустаяДата Тогда
				ВидНарушения = "Прогул";
				Прогул = Истина;
			ИначеЕсли НачалоРаботы - СтрокаТаблицы.НачалоРаботыГрафик > 60 Тогда
				ВидНарушения = "Опоздание";
			КонецЕсли;
			
			Если Не Прогул И Не ТолькоОпоздавшие Тогда 
				Если СтрокаТаблицы.КонецРаботыФакт = ПустаяДата Тогда
					ВидНарушения = ?(ВидНарушения = "", "Уход без отметки", ВидНарушения + "; Уход без отметки");
				ИначеЕсли СтрокаТаблицы.КонецРаботыГрафик - КонецРаботы > 60 Тогда
					ВидНарушения = ?(ВидНарушения = "", "Уход раньше графика", ВидНарушения + "; Уход раньше графика");
				КонецЕсли;
			КонецЕсли;
		
			Если Не ЗначениеЗаполнено(ВидНарушения) Тогда
				Продолжить;
			КонецЕсли;
			ОбластьМакета.Параметры.ВидНарушения = ВидНарушения;
			
			ОбластьМакета.Параметры.Ном = Строка(сч);
			ОбластьМакета.Параметры.СотрудникФИО = СтрокаТаблицы.СотрудникФИО;
			ОбластьМакета.Параметры.Должность = СтрокаТаблицы.Должность;
			ОбластьМакета.Параметры.НачалоГрафик = Формат(СтрокаТаблицы.НачалоРаботыГрафик, "ДЛФ=В");
			ОбластьМакета.Параметры.НачалоФакт = Формат(НачалоРаботы, "ДЛФ=В");
			ОбластьМакета.Параметры.КонецГрафик = Формат(СтрокаТаблицы.КонецРаботыГрафик, "ДЛФ=В");
			ОбластьМакета.Параметры.КонецФакт = Формат(КонецРаботы, "ДЛФ=В");					
			ТабДокумент.Вывести(ОбластьМакета);
			сч = сч + 1;
		КонецЦикла;
		
		//ТабДокумент.Показать();
		Если сч > 0 Тогда
			// сохранить в файл Excel и вернуть полное имя
			ИмяФайла = ПолучитьИмяВременногоФайла("xlsx"); // c:\Users\semenikhin_i\AppData\Local\Temp\v8_E508_74.xlsx
			Попытка
				ТабДокумент.Записать(ИмяФайла, ТипФайлаТабличногоДокумента.XLSX);
			Исключение
				ЗаписьЖурналаРегистрации("Обработка.ФормированиеОтчетаУРВ", 
				        УровеньЖурналаРегистрации.Ошибка, , ,
				        "Ошибка при сохранении файла-отчета: " + ОписаниеОшибки()); 
				Продолжить;
			КонецПопытки;
		Иначе
			ИмяФайла = "";
		КонецЕсли;
		
		НовыйОтчет = ОтчетыПоДЦ.Добавить();
		НовыйОтчет.ДЦ = СтрокаДЦ.ДилерскийЦентр;
		НовыйОтчет.ИмяФайла = ИмяФайла;
	КонецЦикла;
КонецПроцедуры

Процедура РассылкаОтчетаПоУРВ(Параметры = Неопределено) Экспорт
	ТекущаяДата = ТекущаяДата();
	Если Параметры <> Неопределено И ТипЗнч(Параметры[0]) = Тип("ПеречислениеСсылка.ИсточникиРассылки") Тогда
		ИсточникРассылки = Параметры[0];
	Иначе
		ИсточникРассылки = Перечисления.ИсточникиРассылки.УРВ;
	КонецЕсли;
	
	НаборДляРассылки = РегистрыСведений.РассылкаПочты.СоздатьНаборЗаписей();
	НаборДляРассылки.Отбор.ТипРассылки.Установить(Перечисления.ТипыРассылок.ОтчетПоУРВ);
	НаборДляРассылки.Отбор.ИсточникРассылки.Установить(Перечисления.ИсточникиРассылки.УРВ);
	НаборДляРассылки.Прочитать();
	
	НаборДляВсехДЦ = РегистрыСведений.РассылкаПочты.СоздатьНаборЗаписей();
	НаборДляВсехДЦ.Отбор.ТипРассылки.Установить(Перечисления.ТипыРассылок.ВсеОтчетыПоУРВ);
	НаборДляВсехДЦ.Отбор.ИсточникРассылки.Установить(Перечисления.ИсточникиРассылки.УРВ);
	НаборДляВсехДЦ.Прочитать();
	
	Если НаборДляРассылки.Количество() + НаборДляВсехДЦ.Количество() = 0 Тогда
		ЗаписьЖурналаРегистрации("РегламентноеЗадание.РассылкаОтчетаПоУРВ", 
		        УровеньЖурналаРегистрации.Предупреждение, , ,
		        "Список адресатов рассылки пуст!"); 
		Возврат;
	КонецЕсли;
	
	//обрФормироватьОтчет = Обработки.ФормированиеОтчетаУРВ.Создать();
	//обрФормироватьОтчет.Дата = ТекущаяДата;
	//обрФормироватьОтчет.СформироватьОтчет();
	
	// цикл по ТЧ ОтчетыПоДЦ
	Для Каждого СтрокаОтчет Из ОтчетыПоДЦ Цикл
		ЭлПисьмо = Документы.ЭлектронноеПисьмо.СоздатьДокумент();	 
		Для Каждого Рассылка из НаборДляВсехДЦ Цикл
			АдресЭлПочты = киПолучитьПредставлениеКИ(Рассылка.Сотрудники, Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыРабочий);
			Если ЗначениеЗаполнено(АдресЭлПочты) Тогда
				СтрокаПолучатели = ЭлПисьмо.Получатели.Добавить();
				СтрокаПолучатели.АдресЭлектроннойПочты = АдресЭлПочты;
				СтрокаПолучатели.Представление = АдресЭлПочты;
				СтрокаПолучатели.КодГруппыАдреса = Перечисления.КодГруппыАдресаЭлектронногоПисьма.Кому;
		        ЭлПисьмо.ПолучателиПредставление = ЭлПисьмо.ПолучателиПредставление +?(ЭлПисьмо.ПолучателиПредставление = "", АдресЭлПочты, ";" + АдресЭлПочты);
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого Рассылка из НаборДляРассылки Цикл
			// проверка на принадлежность текущему ДЦ
			Подразделение = Рассылка.Сотрудники.Подразделение;
			Если ЗначениеЗаполнено(Рассылка.Подразделение) Тогда
				ДЦРассылка = Рассылка.Подразделение.ДилерскийЦентр;
			Иначе
				ДЦРассылка = Справочники.ДилерскиеЦентры.ПустаяСсылка();
			КонецЕсли;
			Если СтрокаОтчет.ДЦ = Подразделение.ДилерскийЦентр Или СтрокаОтчет.ДЦ = ДЦРассылка Тогда
				АдресЭлПочты = киПолучитьПредставлениеКИ(Рассылка.Сотрудники, Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыРабочий);
				Если ЗначениеЗаполнено(АдресЭлПочты) Тогда
					СтрокаПолучатели = ЭлПисьмо.Получатели.Добавить();
					СтрокаПолучатели.АдресЭлектроннойПочты = АдресЭлПочты;
					СтрокаПолучатели.Представление = АдресЭлПочты;
					СтрокаПолучатели.КодГруппыАдреса = Перечисления.КодГруппыАдресаЭлектронногоПисьма.Кому;
			        ЭлПисьмо.ПолучателиПредставление = ЭлПисьмо.ПолучателиПредставление +?(ЭлПисьмо.ПолучателиПредставление = "", АдресЭлПочты, ";" + АдресЭлПочты);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		Если ЭлПисьмо.Получатели.Количество() = 0 Тогда
			ЗаписьЖурналаРегистрации("РегламентноеЗадание.РассылкаОтчетаПоУРВ", 
			        УровеньЖурналаРегистрации.Предупреждение, , ,
			        "Ни у одного из адресатов рассылки не указан e-mail!"); 
			Возврат;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаОтчет.ИмяФайла) Тогда
			// добавить вложение
			Попытка
				ДвДанные = Новый ДвоичныеДанные(СтрокаОтчет.ИмяФайла);
				ВыбранныйФайл = Новый Файл(СтрокаОтчет.ИмяФайла);
				ФайлВложение = ЭлПисьмо.ПрикрепленныеФайлы.Добавить();
				ФайлВложение.Файл = Новый ХранилищеЗначения(ДвДанные);
				ФайлВложение.Размер = ВыбранныйФайл.Размер();
				ФайлВложение.Имя = Строка(СтрокаОтчет.ДЦ) + "_ОтчетПоУРВ_" + Формат(ТекущаяДата, "ДЛФ=Д") + ВыбранныйФайл.Расширение;
				ЭлПисьмо.ЕстьВложения = Истина;
			Исключение
				ЗаписьЖурналаРегистрации("РегламентноеЗадание.РассылкаОтчетаПоУРВ", 
				        УровеньЖурналаРегистрации.Ошибка, , ,
				        "Ошибка при обработке файла-отчета: " + ОписаниеОшибки()); 
				Возврат;
			КонецПопытки;		
			// Удаление использованного файла-отчета
			Попытка
			    УдалитьФайлы(СтрокаОтчет.ИмяФайла);  
			Исключение
				ЗаписьЖурналаРегистрации("РегламентноеЗадание.РассылкаОтчетаПоУРВ", 
				        УровеньЖурналаРегистрации.Ошибка, , ,
				        "Ошибка при удалении файла-отчета: " + ОписаниеОшибки()); 
			КонецПопытки;
			ЭлПисьмо.ТекстПисьма= "Во вложении - отчёт по УРВ для ДЦ """ + Строка(СтрокаОтчет.ДЦ) + """.";
		Иначе
			ЭлПисьмо.ТекстПисьма= "По ДЦ """ + Строка(СтрокаОтчет.ДЦ) + """ нарушений нет.";
		КонецЕсли;
		
		ЭлПисьмо.Тема = "ДЦ """ + Строка(СтрокаОтчет.ДЦ) + """: отчет по УРВ от " + Формат(ТекущаяДата, "ДЛФ=ДД");
		ЭлПисьмо.УчетнаяЗапись = Справочники.УчетныеЗаписиЭлектроннойПочты.Альфа;	
		ЭлПисьмо.Организация =   ПараметрыСеанса.Пользователь.Организация;
		ЭлПисьмо.ПодразделениеКомпании = ПараметрыСеанса.Пользователь.Подразделение;
		ЭлПисьмо.Автор   = ПараметрыСеанса.Пользователь;
		
		СтрокаСоединения = СтрокаСоединенияИнформационнойБазы();
	    СтрокаСоединения = СтрЗаменить(СтрокаСоединения, ";", Символы.ПС);
		Если Найти(ВРег(СтрокаСоединения), "FILE=") = 1  Тогда
			// файловая
	        ИмяИБ = СтрПолучитьСтроку(СтрокаСоединения, 1);
	    Иначе
			// клиент-сервер
	        ИмяИБ = СтрПолучитьСтроку(СтрокаСоединения, 2);
		КонецЕсли;	
	    Если НЕ Пустаястрока(ИмяИБ) Тогда
			ИмяИБ = Сред(ИмяИБ, Найти(ИмяИБ, """") + 1);
		КонецЕсли;		
		ЭлПисьмо.ОтправительПредставление = "Альфа-Авто" + " (" + Лев(ИмяИБ, СтрДлина(ИмяИБ) - 1) + ") <1c@sokolmotors.ru>";
		
		ЭлПисьмо.ГруппаПисем = Справочники.ГруппыПисемЭлектроннойПочты.НайтиПоНаименованию("Исходящие");
		ЭлПисьмо.Важность = Перечисления.Важность.Средняя;
		ЭлПисьмо.ДатаОтправления = ТекущаяДата;
		ЭлПисьмо.Дата = ТекущаяДата;
		ЭлПисьмо.ХозОперация = Справочники.ХозОперации.ЭлектронноеПисьмо;
		ЭлПисьмо.ФорматТекста = Перечисления.ФорматТекста.ПростойТекст; 
		ЭлПисьмо.Записать();
		
		СтруктураРежимовОбмена = Новый Структура("Получить, Отправить", Ложь, Истина);
		СоединениеСПочтовымСервером = эпПодключитьсяКПочтовомуСерверу(ЭлПисьмо.УчетнаяЗапись, СтруктураРежимовОбмена);
		Если СоединениеСПочтовымСервером <> Неопределено Тогда
			Если эпОтправитьПисьмо(ЭлПисьмо.ЭтотОбъект, СоединениеСПочтовымСервером) Тогда
				эпОтключитьсяОтПочтовогоСервера(СоединениеСПочтовымСервером);
			Иначе
				эпОтключитьсяОтПочтовогоСервера(СоединениеСПочтовымСервером);
			КонецЕсли;	
		КонецЕсли;
    КонецЦикла;

КонецПроцедуры
